app/Http/Controllers/Customer/Auth/CustomerLoginController.php

select * from `stores` where `slug` = 'grocery' limit 1
---
    private function validator(Request $request, $slug)
    {
        $store    = Store::where('slug', $slug)->first();

select exists(select * from `customers` where `email` = 'grocery@example.com' and `theme_id` = 'grocery' and `store_id` = 2) as `exists`
select count(*) as aggregate from `customers` where `email` = 'grocery@example.com' and `theme_id` = 'grocery' and `store_id` = 2
---
                    function ($attribute, $value, $fail) use ($themeId, $storeId) {
                        $customerExists = \DB::table('customers')
                            ->where('email', $value)
                            ->where('theme_id', $themeId)
                            ->where('store_id', $storeId)
                            ->exists();

                        if (!$customerExists) {
                            $fail(__("These credentials do not match our records."));
                        }
                    },
                ],
                'password' => [
                    'required',
                    'string',
                    'min:4',
                    'max:255',
                ],
            ]
        );

        $vali     = Customer::where('email', $request->email)->where('theme_id', $store->theme_id)->where('store_id', $store->id)->count();

select * from `stores` where (`slug` = 'grocery') limit 1
select * from `customers` where `email` = 'grocery@example.com' and `store_id` = 2 limit 1
---
    public function login(Request $request, $slug, $cart = 0)
    {
        if ($this->validator($request, $slug) === true) {
            $store = Store::where(['slug' => $slug])->first();

            $credentials = [
                'email' => $request->email,
                'password' => $request->password,
            ];

            if (!is_null($store)) {
                $credentials['store_id'] = $store->id;
            } else {
                $credentials['store_id'] = 0;
            }

            // Retrieve the user based on the email address
            $user = Customer::where('email', $credentials['email'])->where('store_id',$credentials['store_id'])->first();

select * from `carts` where `customer_id` = 3 and `product_id` = '2' and `variant_id` = 0 and `theme_id` = 'grocery' and `store_id` = 2 limit 1
---
                            $variant_id = !empty($item->variant_id) ? $item->variant_id : 0;
                            $qty = $item->qty;

                            $cart = Cart::where('customer_id', $request->customer_id)
                                        ->where('product_id', $product_id)
                                        ->where('variant_id', $variant_id)
                                        ->where('theme_id', $request->theme_id)
                                        ->where('store_id', $store->id)
                                        ->first();

insert into `carts` (`qty`, `customer_id`, `product_id`, `variant_id`, `price`, `theme_id`, `store_id`, `updated_at`, `created_at`) values ('1', 3, '2', 0, '129.80', 'grocery', 2, '2024-11-19 12:14:29', '2024-11-19 12:14:29')
---
                            $cart->price = $final_price;
                            $cart->theme_id = $request->theme_id;
                            $cart->store_id = $store->id;
                            $cart->save();