app/Helper/helper.php

select `value`, `name` from `settings` where `theme_id` = 'grocery' and `store_id` = '1'
---
    function get_file($path, $theme_id = '')
    {
        $admin = Cache::remember('super_admin_details', 3600, function () {
            return User::where('type','super admin')->first();
        });
        if (empty($theme_id)) {
            $theme_id = APP_THEME() ?? 'grocery';
        }

        $settings = Cache::rememberForever('default_getfile_'.$theme_id.'_'.$admin->current_store, function () use ($theme_id, $admin) {
            return Setting::where('theme_id', $theme_id)->where('store_id', $admin->current_store)->pluck('value', 'name')->toArray();

select `value`, `name` from `settings` where `store_id` = 2 and `theme_id` = 'grocery'
---
            // });
        } elseif (!empty($store_id) && !empty($theme_id)) {
            $settings = [];
            $settings = Setting::where('store_id',$store_id)->where('theme_id',$theme_id)->pluck('value', 'name')->toArray();

select `name`, `id` from `main_categories` where `theme_id` = 'grocery' and `store_id` = 2 and `status` = 1
---
        $theme_image = $theme_image = get_file($theme_image, $theme_id);

        $category_options = Cache::remember('category_options_' . $store->id.'_'.$store->theme_id, 3600, function () use ($store) {
            return MainCategory::where('theme_id', $store->theme_id)
            ->where('store_id', $store->id)
            ->where('status', 1)
            ->pluck('name', 'id')
            ->prepend('All Products', '0');

select * from `pixel_fields` where `store_id` = 2 and `theme_id` = 'grocery'
---
        $fbpixel_code = Utility::GetValueByName('fbpixel_code', $theme_id, $store->id);

        $pixels = Cache::remember('pixels_' . $store->id.'_'.$store->theme_id, 3600, function () use ($store) {
            return  PixelFields::where('store_id', $store->id)
            ->where('theme_id', $store->theme_id)
            ->get();

select * from `pages` where `theme_id` = 'grocery' and `page_status` = '1' and `store_id` = 2
select `value`, `name` from `tax_options` where `store_id` = 2 and `theme_id` = 'grocery'
---
        if (empty($whatsapp_contact_number)) {
            $whatsapp_contact_number = Utility::GetValueByName('whatsapp_number', $theme_id, $store_id);
        }
        $pages = Page::where('theme_id', $store->theme_id)->where('page_status','1')->where('store_id',$store->id)->get();

        $tax_option = Cache::remember('tax_option_' . $store->slug, 3600, function () use ($store) {
            return TaxOption::where('store_id', $store->id)
            ->where('theme_id', $store->theme_id)
            ->pluck('value', 'name')->toArray();

select * from `menus` where `id` in ('2') limit 1
---
    function get_nav_menu($productIds)
    {
        // Fetch the top navigation menu
        $topNav = is_array($productIds)
            ? Menu::whereIn('id', $productIds)->first()

select * from `menu_items` where `id` in ('7', '8', '9', '10')
---

                $menuItemIds = array_unique($menuItemIds);
                // Fetch all menu items at once
                $menuItems = MenuItem::whereIn('id', $menuItemIds)->get()->keyBy('id');

select * from `main_categories` where `theme_id` = 'grocery' and `store_id` = 2
---
    function getThemeMainOrDraftSectionJson($is_publish, $currentTheme, $sectionName, $storeId)
    {
        $theme_id = $currentTheme;
        $store_id = $storeId;
        // Set json file path based on the section name
        $jsonFilePath = base_path("themes/{$currentTheme}/theme_json/{$sectionName}.json");
        if (!file_exists($jsonFilePath)) {
            $jsonFilePath = base_path("/theme_json/{$sectionName}.json");
        }

        // Decode json file content
        $json_data = file_exists($jsonFilePath) ? json_decode(json_encode(json_decode(file_get_contents($jsonFilePath), true))) : [];
        if (is_array($json_data)) {
            $json_data = arrayToObject($json_data);
        }
        // Get section data based on section name and publication status
        $databaseSection = null;
        $produtcs = $categories = $menus = [];

        switch ($sectionName) {
            case 'slider':
                $databaseSection = getDatabaseSection($is_publish, ThemeSliderSection::query(), ThemeSliderSectionDraft::query(), $sectionName, $currentTheme, $storeId);
                break;
            case 'category':
                $categories = Cache::rememberForever('categories_' . $currentTheme.'_'.$storeId, function ()  use ($currentTheme, $storeId) {
                    return MainCategory::where('theme_id', $currentTheme)
                    ->where('store_id', $storeId)
                    ->get();

select `id`, `name` from `products`
select `id`, `name` from `products` where `theme_id` = 'grocery' and `store_id` = 2
select `name`, `id` from `main_categories` where `theme_id` = 'grocery' and `store_id` = 2
---
                $databaseSection = getDatabaseSection($is_publish, ThemeCategorySection::query(), ThemeCategorySectionDraft::query(), $sectionName, $currentTheme, $storeId);
                break;
            case 'bestseller_slider':
                $produtcs = Product::select('id', 'name')->get();
                $produtcs = Cache::rememberForever('produtcs_' . $currentTheme.'_'.$storeId, function ()  use ($currentTheme, $storeId) {
                    return Product::select('id', 'name')->where('theme_id', $currentTheme)
                    ->where('store_id', $storeId)->get();
                });
                $categories = Cache::rememberForever('categories_array_' . $currentTheme.'_'.$storeId, function ()  use ($currentTheme, $storeId) {
                    return MainCategory::where('theme_id', $currentTheme)
                    ->where('store_id', $storeId)
                    ->pluck('name', 'id');

select `id`, `name` from `menus` where `theme_id` = 'grocery' and `store_id` = 2
---
                break;
            case 'header':
                $menus = Cache::rememberForever('menus_' . $currentTheme.'_'.$storeId, function ()  use ($currentTheme, $storeId) {
                    return Menu::select('id', 'name')->where('theme_id', $currentTheme)
                    ->where('store_id', $storeId)->get();

select * from `main_categories` where `theme_id` = 'grocery' and `store_id` = 2 and `status` = 1 and `trending` = 1 limit 4
select * from `main_categories` where `theme_id` = 'grocery' and `store_id` = 2 and `status` = 1 and `trending` = 1
select * from `products` where `theme_id` = 'grocery' and `store_id` = 2 and `product_type` is null and `status` = 1 order by `sale_price` desc limit 12
select * from `products` where `theme_id` = 'grocery' and `store_id` = 2 and `product_type` is null and `status` = 1
select * from `products` where `theme_id` = 'grocery' and `store_id` = 2 and `product_type` is null and `status` = 1 order by RAND() limit 20
---
    function getHomePageDatabaseSectionDataFromDatabase($data)
    {
        // Cache key based on theme_id and store_id
        $cacheKey = "home_page_data_{$data['theme_id']}_{$data['store_id']}";

        // Attempt to retrieve data from cache
        $cachedData = Cache::get($cacheKey);
        if ($cachedData) {
            return $cachedData;
        }

        // Fetch common data once to avoid multiple queries
        $mainCategoryQuery = MainCategory::where('theme_id', $data['theme_id'])
            ->where('store_id', $data['store_id'])
            ->where('status', 1);

        $categories = (clone $mainCategoryQuery)->where('trending', 1)->limit(4)->get();

        $best_categories = (clone $mainCategoryQuery)->where('trending', 1)->get();

        $productQuery = Product::where('theme_id', $data['theme_id'])
            ->where('store_id', $data['store_id'])
            ->where('product_type', null)
            ->where('status', 1);

        // Load discount products
        $discount_products = (clone $productQuery)->orderByDesc('sale_price')->limit(12)->get();

        // Load product information
        $all_slider_products = $products = (clone $productQuery)->get();
        $all_products = (clone $productQuery)->inRandomOrder()->limit(20)->get();

select * from `testimonials` where `status` = 1 and `theme_id` = 'grocery' and `store_id` = 2
---
        $home_page_products = (clone $productQuery)->orderByDesc('created_at')->limit(2)->get();

        // Load reviews
        $reviews = Testimonial::where('status', 1)
            ->where('theme_id', $data['theme_id'])
            ->where('store_id', $data['store_id'])
            ->get();

select * from `main_categories` where `theme_id` = 'grocery' and `store_id` = 2 and `status` = 1
---

        $MainCategoryList = $mainCategoryQuery->with('product_details')->get();
        // dd($MainCategoryList);
        $SubCategoryList = SubCategory::where('status', 1)
            ->where('theme_id', $data['theme_id'])
            ->where('store_id', $data['store_id'])
            ->get();

select `page_name`, `theme_json` from `app_settings` where `theme_id` = 'grocery' and `page_name` in ('common_page') and `store_id` = 2
---
    function getInnerPageJsonData($theme_id, $store_id, $page_names, $default_paths, $specific_page_name = null)
    {
        // Filter page names and default paths if specific page name is provided
        if ($specific_page_name !== null) {
            $index = array_search($specific_page_name, $page_names);
            if ($index === false) {
                return []; // Return empty array if specific page name is not found
            }
            $page_names = [$specific_page_name];
            $default_paths = [$default_paths[$index]];
        }

        $settings = AppSetting::select('page_name', 'theme_json')
            ->where('theme_id', $theme_id)
            ->whereIn('page_name', $page_names)
            ->where('store_id', $store_id)
            ->get()
            ->keyBy('page_name');