app/Http/Controllers/CartController.php

select * from `shipping_methods` where `shipping_methods`.`id` is null limit 1
---
    public function cart_list_sidebar(Request $request, $storeSlug)
    {
        $store = Cache::remember('store_' . $storeSlug, 3600, function () use ($storeSlug) {
            return Store::where('slug', $storeSlug)->first();
        });
        if (empty($store)) {
            $return['status'] = false;
            $return['message'] = __('Something went wrong');
            $return['sub_total'] = 0;
            return response()->json($return);
        }
        $currentTheme = $store->theme_id;
        $slug = $store->slug;
        if (!$request->shipping_price) {
            $shippingMethod = ShippingMethod::find($request->method_id);

select `value`, `name` from `tax_options` where `store_id` = 2 and `theme_id` = 'grocery'
---
        $return['status'] = $response->status;
        $return['message'] = $response->message;
        $return['sub_total'] = 0;
        $tax_option = TaxOption::where('store_id',$store->id)
        ->where('theme_id',$store->theme_id)
        ->pluck('value', 'name')->toArray();

select * from `carts` where `id` = '426' limit 1
---
    public function cart_remove(Request $request, $slug)
    {
        $slug = !empty($request->slug) ? $request->slug : '';
        $store = Cache::remember('store_' . $slug, 3600, function () use ($slug) {
                return Store::where('slug',$slug)->first();
            });
        // $theme_id = $store->theme_id;

        if (auth('customers')->guest()) {
            $Carts = Cookie::get('cart');
            $Carts = json_decode($Carts, true);
            unset($Carts[$request->cart_id]);

            $cart_json = json_encode($Carts);
            Cookie::queue('cart', $cart_json, 1440);
        } else {
            $cart = Cart::where('id', $request->cart_id)->first();

insert into `activity_logs` (`customer_id`, `log_type`, `remark`, `theme_id`, `store_id`, `updated_at`, `created_at`) values (3, 'remove to cart', '{\"product\":2,\"variant\":0}', 'grocery', 2, '2024-11-19 06:44:43', '2024-11-19 06:44:43')
delete from `carts` where `id` = 426
---
                );
                $ActivityLog->theme_id = $cart->theme_id;
                $ActivityLog->store_id = $store->id;
                $ActivityLog->save();
                $cart->delete();