app/Http/Controllers/HomeController.php

select * from `settings` where `name` in ('subdomain', 'domains', 'enable_subdomain', 'enable_domain') and `value` = 'localhost'
---
    public function landing_page($storeSlug)
    {
        $uri = url()->full();
        $segments = explode('/', str_replace(url(''), '', $uri));
        $segments = $segments[1] ?? null;

        $local = parse_url(config('app.url'))['host'];
        $remote = str_replace('www.', '', request()->getHost());

        // Cache the settings
        $settings = Cache::rememberForever('settings_' . $remote, function () use ($remote) {
            return Setting::whereIn('name', ['subdomain', 'domains', 'enable_subdomain', 'enable_domain'])
                ->where('value', $remote)
                ->get()
                ->keyBy('name');

select * from `products` where `slug` = 'oats' and `theme_id` = 'grocery' and `store_id` = 2 limit 1
select * from `main_categories` where `status` = 1 and `theme_id` = 'grocery' and `store_id` = 2
select * from `sub_categories` where `status` = 1 and `theme_id` = 'grocery' and `store_id` = 2
---
    public function product_detail(Request $request, $storeSlug, $product_slug)
    {
        $store = Cache::remember('store_' . $storeSlug, 3600, function () use ($storeSlug) {
            return Store::where('slug', $storeSlug)->first();
        });
        if (!$store) {
            abort(404);
        }
        $store_id = $store->id;
        $slug = $store->slug;
        $currentTheme = $store->theme_id;
        $storeId = $store->id;
        $product = Product::where('slug', $product_slug)->where('theme_id', $currentTheme)->where('store_id', $store_id)->first();
        if (!$product) {
            abort(404);
        }
        $id = $product->id;
        Theme::set($currentTheme);
        $languages = Utility::languages();
        $data = getThemeSections($currentTheme, $storeSlug, true, true);
        $section = (object) $data['section'];
        // Get Data from database
        $sqlData = getHomePageDatabaseSectionDataFromDatabase($data);
        $topNavItems = [];
        $menu_id = (array) $section->header->section->menu_type->menu_ids ??
        [];
        $topNavItems = get_nav_menu($menu_id);

        $MainCategoryList = MainCategory::where('status', 1)->where('theme_id', $currentTheme)->where('store_id', $storeId)->get();
        $SubCategoryList = SubCategory::where('status', 1)->where('theme_id', $currentTheme)->where('store_id', $storeId)->get();

select * from `product_variants` where `product_id` = 12 limit 1
select min(`price`) as aggregate from `product_variants` where `product_id` = 12
select max(`price`) as aggregate from `product_variants` where `product_id` = 12
select min(`variation_price`) as aggregate from `product_variants` where `product_id` = 12
select max(`variation_price`) as aggregate from `product_variants` where `product_id` = 12
---
        $featured_products_data = $ApiController->featured_products($request, $store->slug);
        $featured_products = $featured_products_data->getData();

        $Stocks = ProductVariant::where('product_id', $id)->first();
        if ($Stocks) {
            $minPrice = ProductVariant::where('product_id', $id)->min('price');
            $maxPrice = ProductVariant::where('product_id', $id)->max('price');

            $min_vprice = ProductVariant::where('product_id', $id)->min('variation_price');
            $max_vprice = ProductVariant::where('product_id', $id)->max('variation_price');

select * from `testimonials` where `product_id` = 12
---
            $bestSeller = $bestSeller_fun['bestseller_array'];
        }

        $product_review = Testimonial::where('product_id', $id)->get();

select * from `wishlists` where `product_id` = 12
---
            return redirect()->route('page.product-list', $slug)->with('error', __('Product not found.'));
        }

        $wishlist = Wishlist::where('product_id', $id)->get();