app/Http/Controllers/ProductController.php

select `value`, `name` from `settings` where `theme_id` = 'grocery' and `store_id` = 2
select * from `products` where `products`.`id` = '12' limit 1
---
    public function product_price(Request $request, $slug)
    {
        $store = Cache::remember('store_' . $slug, 3600, function () use ($slug) {
                return Store::where('slug',$slug)->first();
            });
        $theme_id = $store->theme_id;
        $settings = Setting::where('theme_id', $theme_id)->where('store_id', $store->id)->pluck('value', 'name')->toArray();

        $varint = $request->varint;
        $qty = $request->qty;
        $product_id = $request->product_id;
        $return['qty'] = $qty;
        $return['variant_id'] = 0;
        $product = Product::find($product_id);

select * from `product_variants` where `product_id` = '12' and `variant` = '1' limit 1
---
                    }

                    $product->setAttribute('variantName', $variant_name);
                    $ProductStock = ProductVariant::where('product_id', $product_id)
                        ->where('variant', $variant_name)
                        ->first();