app/Models/Cart.php

    public static function addtocart_cookie($product_id = 0, $variant_id = 0, $qty = 0, $theme_id, $store_id,$chart_data = '')
    {
        // $theme_id = APP_THEME();
        // $store_id = getCurrentStore();
        $settings = Utility::Seting($theme_id, $store_id);
        $final_price = 0;
        $cart_count = 0;
        $product = Product::find($product_id);
---
select * from `products` where `products`.`id` = '2' limit 1

    public static function cart_list_cookie($data, $storeid = '')
    {
        $store = Store::find($storeid);
---
select * from `stores` where `stores`.`id` = 2 limit 1

        if (!empty($Carts)) {
            foreach ($Carts as $key => $cart_value) {
                $variant_name = '';
                $cart_product_data = Product::find($cart_value->product_id);
---
select * from `products` where `products`.`id` = '2' limit 1


        $cart_array['sub_total'] = $after_discount_final_price + $shipping_price;

        $tax_option = Cache::remember('tax_option_' . $store->slug, 3600, function () use ($store_id, $theme_id) {
            return TaxOption::where('store_id', $store_id)
            ->where('theme_id', $theme_id)
            ->pluck('value', 'name')->toArray();
        });
---
select `value`, `name` from `tax_options` where `store_id` = 2 and `theme_id` = 'grocery'

    public static function getProductTaxAmount($taxId = null, $sub_total, $storeId, $themeId, $city_id, $state_id, $country, $flag)
    {
        $tax_price = 0;

        $taxs = Cache::remember('tax_methods_' . $storeId .'_'.$themeId.'_'.$taxId, 3600, function () use ($themeId, $storeId, $taxId) {
            return TaxMethod::where('theme_id', $themeId)->where('store_id', $storeId)->where('tax_id', $taxId)->orderBy('priority', 'asc')->get();
        });

        $settings = Cache::remember('tax_options_' . $storeId .'_'.$themeId, 3600, function () use ($themeId, $storeId) {
            return TaxOption::where('theme_id', $themeId)->where('store_id', $storeId)->pluck('value','name')->toArray();
        });
---
select * from `tax_methods` where `theme_id` = 'grocery' and `store_id` = 2 and `tax_id` = '3' order by `priority` asc
select * from `tax_methods` where `theme_id` = 'grocery' and `store_id` = 2 and `tax_id` = '4' order by `priority` asc
select `value`, `name` from `tax_options` where `theme_id` = 'grocery' and `store_id` = 2