app/Models/MainCategory.php

select count(*) as aggregate from `products` where `products`.`maincategory_id` = 19 and `products`.`maincategory_id` is not null
---
    public function getTotalProductAttribute() {
        $count = $this->product_details()->count();

select `maincategory_id` from `products` where `theme_id` = 'grocery' and `store_id` = 2 group by `maincategory_id`
select * from `main_categories` where `id` in (14, 16, 17, 18, 19, 20, 207) limit 4
---
    public static function homePageBestCategory($themeId, $slug, $section, $no = 2)
    {
        $currentTheme = $themeId;
        $storeId = getCurrenctStoreId($slug);
        $best_seller_category = \Cache::remember('best_seller_best_category_'.$storeId.'_'.$themeId, 3600, function () use ($themeId, $storeId, $no) {
            $cat = Product::select('maincategory_id')->where('theme_id', $themeId)->where('store_id', $storeId)->groupBy('maincategory_id')->pluck('maincategory_id');
            return MainCategory::whereIn('id', $cat->toArray())->limit($no)->get();