app/Models/Product.php

select * from `products` where `theme_id` = 'grocery' and `store_id` = 2 and `status` = 1 order by RAND() limit 12
---
    public static function bestseller_guest($theme_id = null, $storeId = null, $per_page = '6', $destination = 'app')
    {
        $bestseller_array_query = Product::where('theme_id', $theme_id)->where('store_id', $storeId)->where('status' , 1);
        if (!empty($destination) && $destination == 'web') {
            if ($per_page != 'all') {
                $bestseller_array_query->limit($per_page);
            }
            $bestseller_array = $bestseller_array_query->inRandomOrder()->get();

select * from `product_images` where `product_id` = 1
---
    public static function Sub_image($product_id = 0)
    {
        $return['status'] = false;
        $return['data'] = [];
        $ProductImage = Cache::remember('product_image_' . $product_id, 3600, function () use ($product_id) {
            return ProductImage::where('product_id', $product_id)->get();

select exists(select * from `wishlists` where `product_id` = 1 and `customer_id` = 3) as `exists`
---
    public function getInWhishlistAttribute()
    {
        $id = !empty(auth('customers')->user()) ? auth('customers')->user()->id : 0;
        if (empty($id)) {
            $id = auth()->user() ? auth()->user()->id : 0;
        }
        $wishlist = Cache::remember("wishlist_{$this->id}_{$id}", 3600, function () use ($id) {
            return Wishlist::where('product_id', $this->id)->where('customer_id', $id)->exists();

select exists(select * from `carts` where `product_id` = 2 and `customer_id` = 3) as `exists`
---
    public function getInCartAttribute()
    {
        $id = !empty(auth('customers')->user()) ? auth('customers')->user()->id : 0;
        return Cart::where('product_id', $this->id)->where('customer_id', $id)->exists();

select * from `products` where `products`.`id` = 1 limit 1
select * from `taxes` where `taxes`.`id` = '3' limit 1
select * from `tax_methods` where `tax_id` = '3' and `theme_id` = 'grocery' and `store_id` = 2 order by `priority` asc limit 1
select `value`, `name` from `tax_options` where `store_id` = 2 and `theme_id` = 'grocery'
select * from `flash_sales` where `theme_id` = 'grocery' and `store_id` = 2 and `is_active` = 1
---
    public static function ProductPrice($theme, $slug, $productId,$variantId = 0,$price=0)
    {
        $store = Cache::remember('store_' . $slug, 3600, function () use ($slug) {
                return Store::where('slug',$slug)->first();
            });
        $storeId = getCurrenctStoreId($slug);
        $product = Cache::remember('product_' . $productId, 3600, function () use ($productId) {
            return Product::find($productId);
        });
        if(empty($price))
        {
            $price = $product->sale_price;
        }
        // $price = $product->sale_price;
        $tax = Cache::remember('taxes_' . $product->tax_id, 3600, function () use ($product) {
            return Tax::find($product->tax_id);
        });

        $taxmethod = Cache::remember('tax_option_' . $product->tax_id.'_'.$theme.'_'.$storeId, 3600, function () use ($product, $theme, $storeId) {
            return TaxMethod::where('tax_id',$product->tax_id)->where('theme_id', $theme)->where('store_id', $storeId)->orderBy('priority', 'asc')->first();
        });
        $tax_option = Cache::remember('tax_option_' . $store->slug.'_'.$store->theme_id, 3600, function () use ($store) {
            return TaxOption::where('store_id', $store->id)
            ->where('theme_id', $store->theme_id)
            ->pluck('value', 'name')->toArray();
        });

        date_default_timezone_set('Asia/Kolkata');
        $currentDateTime = \Carbon\Carbon::now()->toDateTimeString();
        $sale_product = Cache::remember("flash_sale_{$store->theme_id}_{$store->id}", 3600, function () use ($store) {
            return FlashSale::where('theme_id', $store->theme_id)
            ->where('store_id', $store->id)
            ->where('is_active', 1)
            ->get();

select * from `product_variants` where `product_id` = 12 and `id` = 5 limit 1
---
                    $price = $product->sale_price - $discount_price;
                }
            } else {
                $product_variant_data = ProductVariant::where('product_id', $product->id)->where('id',$variantId)->first();

select * from `product_variants` where `id` = 5 limit 1
---
                        $price = $price + $tax_price;
                    }
                }else{
                    $variant_data = ProductVariant::where('id', $variantId)->first();

select * from `product_variants` where `variant` is null and `product_id` = 2 limit 1
---
    public function getOriginalPriceAttribute()
    {
        $variantId = $this->getAttribute('variantId');
        $variantName = $this->getAttribute('variantName');
        $variant_data = ProductVariant::where('variant', $variantName)->where('product_id', $this->id)->first();

select * from `product_variants` where `variant` is null and `product_id` = 2 limit 1
select * from `flash_sales` where `theme_id` is null and `store_id` is null
---
    public function getFinalPriceAttribute()
    {
        $variantId = $this->getAttribute('variantId');
        $variantName = $this->getAttribute('variantName');
        $variant_data = ProductVariant::where('variant', $variantName)->where('product_id', $this->id)->first();

        $variant_id = !empty($variantId) ? $variantId : ($variant_data ? $variant_data->id : null);
        $price = $this->price;
        $discount_type = $this->discount_type;
        $discount_amount = $this->discount_amount;
        date_default_timezone_set('Asia/Kolkata');
        $currentDateTime = \Carbon\Carbon::now()->toDateTimeString();
        $sale_product = \App\Models\FlashSale::where('theme_id', APP_THEME())
            ->where('store_id', getCurrentStore())
            ->get();

select * from `product_variants` where `product_id` = 12 and `id` = 5 limit 1
---
                    $price = $this->price - $discount_price;
                }
            } else {
                $product_variant_data = ProductVariant::where('product_id', $this->id)->where('id',$variant_id)->first();