app/Models/Utility.php

select * from `settings` where `store_id` = 2 and `theme_id` = 'grocery'
select * from `settings` where `created_by` = 1 and `store_id` = 1 and `theme_id` = 'grocery'
---
            if ($theme_id !== null && $store_id !== null) {
                // Fetch settings based on the provided store_id and theme_id
                $data = Cache::rememberForever("default_setting_{$store_id}_{$theme_id}", function () use ($store_id, $theme_id) {
                    return Setting::where('store_id', $store_id)
                                  ->where('theme_id', $theme_id)
                                  ->get();
                });
            } else {
                // Fallback to default settings for unauthenticated users
                $data = Cache::rememberForever('default_setting_1_grocery', function () {
                    return Setting::where('created_by', 1)
                                  ->where('store_id', 1)
                                  ->where('theme_id', 'grocery')
                                  ->get();
                });

select `value`, `name` from `settings` where `theme_id` = 'grocery' and `store_id` = 2
---
    public static function GetValueByName($name = '', $theme_id = '', $store_id = '')
    {
        // Set the theme_id and store_id if not provided
        $theme_id = !empty($theme_id) ? $theme_id : APP_THEME();
        $store_id = !empty($store_id) ? $store_id : getCurrentStore();
        $return = null;
        if (!empty($name)) {
            // Create a unique cache key based on store_id and theme_id
            $cacheKey = "settings_store_{$store_id}_theme_{$theme_id}";

            // Retrieve the settings from cache or store them if not already cached
            $settings = Cache::rememberForever($cacheKey, function () use ($theme_id, $store_id) {
                // Initialize the query
                $query = Setting::query();

                // Apply the theme_id condition only if it's not empty
                if (!empty($theme_id)) {
                    $query->where('theme_id', $theme_id);
                }

                // Apply the store_id condition only if it's not empty
                if (!empty($store_id)) {
                    $query->where('store_id', $store_id);
                }

                // Return the result as an associative array (pluck)
                return $query->pluck('value', 'name')->toArray();

select `value` from `settings` where `name` = 'disable_lang' and `created_by` = 1 limit 1
---
            function ($value) use ($dir) {
                return preg_replace('/[0-9]+/', '', $value);
            },
            $arrLang
        );
        $arrLang = array_filter($arrLang);

        $test = base_path('resources/lang/language.json');
        $arrLang = json_decode(file_get_contents($test), true);

        // If user is super admin, show all languages
        if (auth()->check() && auth()->user()->type == 'super-admin') {
            return $arrLang;
        }
        // Default settings
        $setting = [];

        // Get disabled languages from settings for admin and non-authenticated users
        if (!auth()->check() || (auth()->check() && auth()->user()->type == 'admin')) {
            $supperadminSetting = Setting::where('name', 'disable_lang')
                                        ->where('created_by', 1)
                                        ->value('value');

select count(*) as aggregate from `sub_categories` where `store_id` = 2 and `theme_id` = 'grocery'
---
    public static function themeSubcategory($theme_id = null, $store_id = null)
    {
        if (empty($theme_id)) {
            $theme_id = APP_THEME();
        }

        if (empty($store_id)) {
            $store_id = getCurrentStore();
        }

        $return = 0;
        // $path =  base_path('themes/' . $theme_id . '/theme_json/' . 'subcategory.json');
        // if ($path && file_exists($path)) {
        //     $res =  file_get_contents($path);
        //     if (!empty($res) && $res == 'on') {
        //         $return = 1;
        //     }
        // }
        if (!empty($store_id) && !empty($theme_id)) {
            $count = SubCategory::where('store_id', $store_id)->where('theme_id', $theme_id)->count();